const n="ai.md",t="post",o="ai",a=`
有了 AI 之后，区分是非黑白变得更难了。

在 chatGPT 推出之前，劣质的文章一眼就能看出来，要么是机器抓取排版非常的差，要么是小编类文体，结尾都是你怎么看呢。可以说基本不用费精力就能区分，然后自然也不用浪费时间继续阅读。

但 GPT 之后，这类虚假的创作变得更隐晦了。想要区分是否事实或者是否准确就要仰仗阅读人的知识结构。我可以在我熟悉的领域通过我过往的经验来区分 AI 提供的信息是否准确，以及我们互相配合经过我的修剪可以让最终的产物变得准确。但是更多的人是将 AI 的产物直接输出，甚至批量制造。大多数人看到这样的东西，很难在短时间区分所看到的是否准确，也可能造成难以想象的后果。

假如用我的生活经验写了一篇文章来分享，那么受我和读者不同身份和所处环境的影响，读者大抵可以判断出应用在自身是否合适。假如 AI 模拟一个身份，恰好和读者身份相符，那在不知道该文章由 AI 生成之前，读者可能会疑惑为什么他可以我不行，在多次尝试浪费足够多的时间之后才发现原来这个是一本正经的胡扯，根本没有参考性，那 AI 带来的就是直接的坏处，浪费了读者的时间。

其实除了这种直接的恶性影响外，我也有一些私人上的抵触。前段时间看到有人做了一个博客聚合平台，并使用 AI 来总结博文内容，在他的聚合平台上输出。还有部分 RSS 平台，不全文拉取，只拉取概要。这个概要部分有的是作者手写的，有的是工具输出的。但是问题就出现在这了，AI 的总结非人的痕迹太明显，游离在第一人称之外，看到这个概要之后瞬间就没有兴趣点下去了。因为一开头的门面就感觉不到人味儿，那谁还有兴趣继续往下走呢。

最近我的博客也在写给 RSS 抓取的概要，因为不想让读者有这种不好的体验，还是手动的。或者总结，或者输出一点片段吸引人点开查看全文。不想因为没有人味儿而离开。
`,e={title:"AI 味儿",description:"AI 味，就是没有人味儿，在新闻里面可能会曲解新闻的意思，在个人风格的文章中会损失作者的个人风格也就是损失了人的味道。",publishDate:new Date(17105472e5),draft:!1,tags:["生活"]},s={type:"content",filePath:"/home/runner/work/blog/blog/src/content/post/ai.md",rawData:`
title: "AI 味儿"
description: "AI 味，就是没有人味儿，在新闻里面可能会曲解新闻的意思，在个人风格的文章中会损失作者的个人风格也就是损失了人的味道。"
publishDate: "16 Mar 2024"
tags: ["生活"]`};export{s as _internal,a as body,t as collection,e as data,n as id,o as slug};
