import{c as e,r as o,m as r}from"./render-template.DwiokGIo.js";import{u as s}from"./hoisted.KmIsB1Oe.js";import"./astro/assets-service.CWtZdUDo.js";const t=`<h2 id="1-序你还剩多少时间追求幸福">1. 序：你还剩多少时间追求幸福？</h2>
<h2 id="2-为何要写这篇文章">2. 为何要写这篇文章？</h2>
<h2 id="3-幸福的定义">3. 幸福的定义</h2>
<h3 id="31-its-all-about-time">3.1 It’s all about time</h3>
<h3 id="32-幸福是什么">3.2 幸福是什么？</h3>
<h3 id="33-幸福终局是一种幻觉">3.3 幸福终局是一种幻觉</h3>
<p>3.4 幸福人生是一个过程
3.5 延迟满足≈不满足
3.6 钱是制约我追求幸福的障碍吗？
4. 当下是改变最好的时间点
4.1 不确定的时代=可能性的时代
4.2 规训是最为无力的约束
4.3 脱离社会时钟，是躺平或摆烂吗？
4.4 35岁：危机还是起点？
5. 狗屁工作
5.1 为钱工作
5.2 在科层制中为地位而工作
5.3 “看起来舒适”的工作
5.4 影响生活方式的工作思维：目标导向与增长成瘾
6. 寻找幸福
6.1 天职是什么？
6.2 天职不是什么？
6.3 面向过程工作，而不是面向对象工作
6.4 我需要多少钱？
6.5 副业的作用
6.6 我尝试过许多，但最终，它们都失败了……
7. 实操：如何离开苦役？
7.1 逃离职场 PUA 的五种思维：
7.1.1 跳出隧道视野
7.1.2 架空奖励机制
7.1.3 拒绝个体命运与公司挂钩
7.1.4 现在吃苦，并不意味着以后“享福”
7.1.5 行业不好， 是不是真的找不到下一份工作了？
7.2 房子，工作与教育
7.2.1 房子
7.2.2 工作
7.2.3 孩子教育
8. 尾声
9. 附录：用认知行为疗法的重塑精神规训</p>`,i={title:"Refactoring UI",description:"作者读了一本关于应用设计的书，并将自己的感想和书中内容写成了本篇笔记作者读了一本关于应用设计的书，并将自己的感想和书中内容写成了本篇笔记",publishDate:"10 Jan 2024",tags:["Design","Develop"],draft:!0,minutesRead:"2 min read"},a="/home/runner/work/blog/blog/src/content/post/ui/index.md",l=void 0;function f(){return`## 1. 序：你还剩多少时间追求幸福？
## 2. 为何要写这篇文章？
## 3. 幸福的定义
   ### 3.1 It’s all about time
   ### 3.2 幸福是什么？
   ### 3.3 幸福终局是一种幻觉
   3.4 幸福人生是一个过程
   3.5 延迟满足≈不满足
   3.6 钱是制约我追求幸福的障碍吗？
4. 当下是改变最好的时间点
   4.1 不确定的时代=可能性的时代
   4.2 规训是最为无力的约束
   4.3 脱离社会时钟，是躺平或摆烂吗？
   4.4 35岁：危机还是起点？
5. 狗屁工作
   5.1 为钱工作
   5.2 在科层制中为地位而工作
   5.3 “看起来舒适”的工作
   5.4 影响生活方式的工作思维：目标导向与增长成瘾
6. 寻找幸福
   6.1 天职是什么？
   6.2 天职不是什么？
   6.3 面向过程工作，而不是面向对象工作
   6.4 我需要多少钱？
   6.5 副业的作用
   6.6 我尝试过许多，但最终，它们都失败了……
7. 实操：如何离开苦役？
   7.1 逃离职场 PUA 的五种思维：
   7.1.1 跳出隧道视野
   7.1.2 架空奖励机制
   7.1.3 拒绝个体命运与公司挂钩
   7.1.4 现在吃苦，并不意味着以后“享福”
   7.1.5 行业不好， 是不是真的找不到下一份工作了？
   7.2 房子，工作与教育
   7.2.1 房子
   7.2.2 工作
   7.2.3 孩子教育
8. 尾声
9. 附录：用认知行为疗法的重塑精神规训
`}function b(){return t}function x(){return[{depth:2,slug:"1-序你还剩多少时间追求幸福",text:"1. 序：你还剩多少时间追求幸福？"},{depth:2,slug:"2-为何要写这篇文章",text:"2. 为何要写这篇文章？"},{depth:2,slug:"3-幸福的定义",text:"3. 幸福的定义"},{depth:3,slug:"31-its-all-about-time",text:"3.1 It’s all about time"},{depth:3,slug:"32-幸福是什么",text:"3.2 幸福是什么？"},{depth:3,slug:"33-幸福终局是一种幻觉",text:"3.3 幸福终局是一种幻觉"}]}const C=e((u,d,p)=>{const{layout:h,...n}=i;return n.file=a,n.url=l,o`${r()}${s(t)}`});export{C as Content,b as compiledContent,C as default,a as file,i as frontmatter,x as getHeadings,f as rawContent,l as url};
