import{c as e,r as p,m as o}from"./render-template.CeqbiL6_.js";import{u}from"./hoisted._G0dPGaG.js";import"./astro/assets-service.DcMRmNXG.js";const t=`<p>不知不觉已经来上海10年了。突然有天脑子一热想起我在上海还住过这么多的房子，给来上海打拼的人分享一下这段经历。</p>
<h2 id="第一个房子">第一个房子</h2>
<blockquote>
<p>公司租在附近的公寓，像大学宿舍一样。</p>
</blockquote>
<p>这是来到上海的第一个房子，也是公司统一安排并且支付了半年的租金。给首次来到陌生的城市的人一个平滑的过渡。
离公司很近，走路10分钟就到了，但是距离商业区远，出去玩还要公交转地铁。听说一个溜冰场改造成的公寓，所以水电计算按照商业计费，比较贵一点。一个房间能住2-3个人，有桌子有床和大学宿舍一样。公司提供三餐，这个时候生活还是很简单的，每天上班下班，周末出去玩。</p>
<p>类群居的生活有点像大学宿舍，时不时就可以来个串门，假如室友是交际花，那么被动的就没有隐私，我也不是很喜欢突如其来的造访。出于这个考虑，一年后和同事合租搬出去了。</p>
<h2 id="第二个房子">第二个房子</h2>
<blockquote>
<p>签订了住房合同，提前搬走没有拿回押金。</p>
</blockquote>
<p>这个房子在热闹一点的地方，回归了民用水电，楼下小吃丰富，出门就是地铁，走几步就是商业街，比之前方便了不少。在这个时候我还买了一个人体工学椅，算是追求生活质量的第一个投入。
室友住了半年搬走了，我在搬走前也找到了下一个住处。退房的时候，合同写的有变化提前一个月沟通可以退回押金，但是房东不同意，加上我的下一个房子可能有地方要咨询她，即便中介在和房东沟通，我还是和房东达成一致，押金就半推半就象征性的退了一点点。
今后的合同都是违约方承当损失，我的这个行为在今后的合同上都是无法拿到押金的。这算是商业社会的一个小插曲吧。</p>
<p>小区排水不好，下大雨的时候水可以漫过鞋面，房子里面有北方人没见过的超大蟑螂，我怕它们胜过它们怕我。室友走了我也无法独自承担这个成本，所以我也是很快就搬走了。</p>
<h2 id="第三个房子">第三个房子</h2>
<blockquote>
<p>没有签订租房合同，提前搬走也拿回了押金。</p>
</blockquote>
<p>这次搬到了陆家嘴的城中村。
我的室友是二房东他和房东第一次租房合同到期后就没再签合同，但是继续保持了租房关系，所以我自然也看不到租房合同。同时我是通过同城交流的社区找到的对方，也没有中介帮我们起草一份正式的合同。所以，这次的租住关系，是没有合同保障的。只有一个手写的收据，也不知道是否有法律效力。
在上一个房子搬出来的时候，和房东咨询的就是这件事，她是一个律师，说这样我的权益得不到保障。我还是从人性上面考虑，通过二房东很有限的行为推断今后的可能性，还是搬了进去。
陆家嘴走路上班，这份舒适的感觉让我走路都不自觉的挺胸了。晚上还可以去黄浦江边跑步，生活算是提高了吧。但是房间小的很，只有一个床的位置，之前的人体工学椅就卖掉了。</p>
<p>虽然房子距离公司很近，但是因为没有通勤时间，消耗在通勤时间该看的书是一点也没看。这时候决定强化一下技能，辞职去表哥家待了有半年。</p>
<h2 id="第四个房子">第四个房子</h2>
<blockquote>
<p>免费的房子</p>
</blockquote>
<p>这是两个大学室友合租的房子。其中一个人在刚来上海的时候在我的第二个住处生活过一段时间，这次回到上海没有直接找房子，而是在他那住了三个多月。
他们租的两室一厅，还养了一只猫。在这个房子里很快找到了回到上海的第一份工作，但是不是特别理想，所以1个月后通过技术分享会找到了我工作时间最久的工作。
回想起这个经历真是唏嘘。当时工作很容易找到，gap了半年加上工作一个月就换工作，这种情况依然可以很快的找到想要的工作。</p>
<p>不想再给同学添麻烦，搬出来了这个三人一猫的小窝。</p>
<h2 id="第五个房子">第五个房子</h2>
<blockquote>
<p>近到可以中午回家睡觉</p>
</blockquote>
<p>这个房子比陆家嘴的房间要大一些，有了床也有了桌子。生活质量进一步提高，当年戴森推出v6型号的吸尘器，比我的房租还贵，我用它来打扫这个房子。
这个房子给我带来很多便利，合租室友是高中老师，有时候会带学生回家来补课。看着门外或站着或坐着的上海本地人对我礼貌的问好。像是借了室友的光，也得到了陌生人的善待，感觉非常舒服。</p>
<p>离开这里是因为恋爱了，搬到了女朋友那里。这样至少能节省一份房租了。</p>
<h2 id="第六个房子">第六个房子</h2>
<blockquote>
<p>剧组到小区取景</p>
</blockquote>
<p>我和女朋友在一个公司，这个房子距离公司也挺近，可以骑自行车上下班。她担心房子的安全问题，所以租到了这个稍微好一点的小区。而且核心商圈附近，周末看电影和咖啡都非常方便。甚至我是因为来她家玩的时候第一次买咖啡。也是被她带的养成了每天至少一杯咖啡的习惯。</p>
<p>这个房子的价格搬出来的时候我都不知道具体是多少，但是可能真的很贵。我的工资比她低很多我都攒了很多钱，她反而是认识我之后把很多负债变成了没有负债。这个时候我们考虑买房等一系列问题，一起搬去了政府的公租房，这里办理手续也不用麻烦房东了，最重要的是房租价格也下来了，攒钱的速度进一步加快了。</p>
<h2 id="第七个房子">第七个房子</h2>
<blockquote>
<p>空手买房</p>
</blockquote>
<p>差不多首付钱完全是借来的买了这一套房子。真是一个非常离谱的事情，我们攒的首付在上海房价面前真是杯水车薪。在买房的时间节点上，她的下属刚刚好卖了房子，手里的钱暂时还没有地方用，所以我们给了一个略高的利息借用他的钱来把房子买了下来。</p>
<p>之后靠着各种途径贷款把他的钱还上。</p>
<h2 id="第八个房子">第八个房子</h2>
<blockquote>
<p>黄浦江边溜达</p>
</blockquote>
<h2 id="第九个房子">第九个房子</h2>`,l={title:"我居住过的房子",publishDate:"8 Mar 2024",description:"在上海生活的十年，我住过很多的房子，房子有大有小，也住过租金是第一份工作四倍的房子，他们都是在对应时期做的最佳选择，现在回想一一列出还挺有意思",tags:["生活"],draft:!0,minutesRead:"10 min read"},r="/home/runner/work/blog/blog/src/content/post/the-houses-i-have-lived-in.md",s=void 0;function g(){return`
不知不觉已经来上海10年了。突然有天脑子一热想起我在上海还住过这么多的房子，给来上海打拼的人分享一下这段经历。

## 第一个房子

> 公司租在附近的公寓，像大学宿舍一样。

这是来到上海的第一个房子，也是公司统一安排并且支付了半年的租金。给首次来到陌生的城市的人一个平滑的过渡。
离公司很近，走路10分钟就到了，但是距离商业区远，出去玩还要公交转地铁。听说一个溜冰场改造成的公寓，所以水电计算按照商业计费，比较贵一点。一个房间能住2-3个人，有桌子有床和大学宿舍一样。公司提供三餐，这个时候生活还是很简单的，每天上班下班，周末出去玩。

类群居的生活有点像大学宿舍，时不时就可以来个串门，假如室友是交际花，那么被动的就没有隐私，我也不是很喜欢突如其来的造访。出于这个考虑，一年后和同事合租搬出去了。

## 第二个房子

> 签订了住房合同，提前搬走没有拿回押金。

这个房子在热闹一点的地方，回归了民用水电，楼下小吃丰富，出门就是地铁，走几步就是商业街，比之前方便了不少。在这个时候我还买了一个人体工学椅，算是追求生活质量的第一个投入。
室友住了半年搬走了，我在搬走前也找到了下一个住处。退房的时候，合同写的有变化提前一个月沟通可以退回押金，但是房东不同意，加上我的下一个房子可能有地方要咨询她，即便中介在和房东沟通，我还是和房东达成一致，押金就半推半就象征性的退了一点点。
今后的合同都是违约方承当损失，我的这个行为在今后的合同上都是无法拿到押金的。这算是商业社会的一个小插曲吧。

小区排水不好，下大雨的时候水可以漫过鞋面，房子里面有北方人没见过的超大蟑螂，我怕它们胜过它们怕我。室友走了我也无法独自承担这个成本，所以我也是很快就搬走了。

## 第三个房子

> 没有签订租房合同，提前搬走也拿回了押金。

这次搬到了陆家嘴的城中村。
我的室友是二房东他和房东第一次租房合同到期后就没再签合同，但是继续保持了租房关系，所以我自然也看不到租房合同。同时我是通过同城交流的社区找到的对方，也没有中介帮我们起草一份正式的合同。所以，这次的租住关系，是没有合同保障的。只有一个手写的收据，也不知道是否有法律效力。
在上一个房子搬出来的时候，和房东咨询的就是这件事，她是一个律师，说这样我的权益得不到保障。我还是从人性上面考虑，通过二房东很有限的行为推断今后的可能性，还是搬了进去。
陆家嘴走路上班，这份舒适的感觉让我走路都不自觉的挺胸了。晚上还可以去黄浦江边跑步，生活算是提高了吧。但是房间小的很，只有一个床的位置，之前的人体工学椅就卖掉了。

虽然房子距离公司很近，但是因为没有通勤时间，消耗在通勤时间该看的书是一点也没看。这时候决定强化一下技能，辞职去表哥家待了有半年。

## 第四个房子

> 免费的房子

这是两个大学室友合租的房子。其中一个人在刚来上海的时候在我的第二个住处生活过一段时间，这次回到上海没有直接找房子，而是在他那住了三个多月。
他们租的两室一厅，还养了一只猫。在这个房子里很快找到了回到上海的第一份工作，但是不是特别理想，所以1个月后通过技术分享会找到了我工作时间最久的工作。
回想起这个经历真是唏嘘。当时工作很容易找到，gap了半年加上工作一个月就换工作，这种情况依然可以很快的找到想要的工作。

不想再给同学添麻烦，搬出来了这个三人一猫的小窝。

## 第五个房子

> 近到可以中午回家睡觉

这个房子比陆家嘴的房间要大一些，有了床也有了桌子。生活质量进一步提高，当年戴森推出v6型号的吸尘器，比我的房租还贵，我用它来打扫这个房子。
这个房子给我带来很多便利，合租室友是高中老师，有时候会带学生回家来补课。看着门外或站着或坐着的上海本地人对我礼貌的问好。像是借了室友的光，也得到了陌生人的善待，感觉非常舒服。

离开这里是因为恋爱了，搬到了女朋友那里。这样至少能节省一份房租了。

## 第六个房子

> 剧组到小区取景

我和女朋友在一个公司，这个房子距离公司也挺近，可以骑自行车上下班。她担心房子的安全问题，所以租到了这个稍微好一点的小区。而且核心商圈附近，周末看电影和咖啡都非常方便。甚至我是因为来她家玩的时候第一次买咖啡。也是被她带的养成了每天至少一杯咖啡的习惯。

这个房子的价格搬出来的时候我都不知道具体是多少，但是可能真的很贵。我的工资比她低很多我都攒了很多钱，她反而是认识我之后把很多负债变成了没有负债。这个时候我们考虑买房等一系列问题，一起搬去了政府的公租房，这里办理手续也不用麻烦房东了，最重要的是房租价格也下来了，攒钱的速度进一步加快了。

## 第七个房子

> 空手买房

差不多首付钱完全是借来的买了这一套房子。真是一个非常离谱的事情，我们攒的首付在上海房价面前真是杯水车薪。在买房的时间节点上，她的下属刚刚好卖了房子，手里的钱暂时还没有地方用，所以我们给了一个略高的利息借用他的钱来把房子买了下来。

之后靠着各种途径贷款把他的钱还上。

## 第八个房子

> 黄浦江边溜达

## 第九个房子`}function m(){return t}function q(){return[{depth:2,slug:"第一个房子",text:"第一个房子"},{depth:2,slug:"第二个房子",text:"第二个房子"},{depth:2,slug:"第三个房子",text:"第三个房子"},{depth:2,slug:"第四个房子",text:"第四个房子"},{depth:2,slug:"第五个房子",text:"第五个房子"},{depth:2,slug:"第六个房子",text:"第六个房子"},{depth:2,slug:"第七个房子",text:"第七个房子"},{depth:2,slug:"第八个房子",text:"第八个房子"},{depth:2,slug:"第九个房子",text:"第九个房子"}]}const f=e((c,h,d)=>{const{layout:i,...n}=l;return n.file=r,n.url=s,p`${o()}${u(t)}`});export{f as Content,m as compiledContent,f as default,r as file,l as frontmatter,q as getHeadings,g as rawContent,s as url};
