import{c as e,r as o,m as p}from"./render-template.BPP3MIM5.js";import{u}from"./hoisted.18HnhlLJ.js";import"./astro/assets-service.DcMRmNXG.js";const t=`<p>不知不觉已经来上海10年了。突然有天脑子一热想起我在上海还住过这么多的房子，给来上海打拼的人分享一下这段经历。</p>
<h2 id="第一个房子">第一个房子</h2>
<blockquote>
<p>公司租在附近的公寓，像大学宿舍一样。</p>
</blockquote>
<p>来到上海的第一个房子是公司帮忙给租的并且支付了半年的租金，因为是校招直接过来，也算是让我们初来乍到的异乡的人有一个平滑的过渡。
这个房子是在公司附近的一个公寓，离公司很近，走路10分钟就到了，但是距离商业区远，出去玩还要公交转地铁。电费是商业的资费，一个房间能住2-3个人，有桌子有床和大学宿舍一样。
离公司近，公司食堂有三餐，所以这个时候的生活还是很简单的，每天上班下班，周末出去玩。</p>
<p>类群居的生活有点像大学宿舍，时不时就可以来个串门，出于隐私的考虑，我也不是很喜欢突如其来的造访。出于这个考虑，一年后和同事合租搬出去了。</p>
<h2 id="第二个房子">第二个房子</h2>
<blockquote>
<p>中介极力劝说房东退押金给我，但是我放弃了</p>
</blockquote>
<p>这个房子在热闹一点的地方，回归了民用水电，楼下小吃丰富，出门就是地铁，走几步就是商业街，比之前方便了不少。在这个时候我还买了一个人体工学椅，算是追求生活质量的第一个投入。
室友住了半年搬走了，我在两个月后也换工作搬走了。合同写的有变化提前一个月沟通可以退回押金，但是房东不同意，加上我的下一个房子可能有地方要咨询她，即便中介在和房东沟通，我还是和房东达成一致，押金就半推半就象征性的退了一点点。
实际今后的合同都是违约方承当损失，我的这个行为在今后的合同上都是无法拿到押金的。这算是商业社会的一个小插曲吧。</p>
<p>小区排水不好，下大雨的时候水可以漫过鞋面，房子里面有北方人没见过的超大蟑螂，我怕它们胜过它们怕我。其实失去了室友这个成本也有点高，所以我也是很快就搬走了。</p>
<h2 id="第三个房子">第三个房子</h2>
<blockquote>
<p>没有签订租房合同。我提前搬走还要回了押金。</p>
</blockquote>
<p>这次搬到了陆家嘴的城中村，一楼(这个阶段有了楼层的意识)。我的室友二房东他和房东第一次租房合同到期后就没再签合同，但是继续保持了租房关系，所以我自然也看不到租房合同，同时我也不是通过中介联系到的，我们也就没有一份正式的合同。
在上一个房子搬出来的时候，和房东咨询的就是这件事，她是一个律师，说这样我的权益得不到保障。但这个经历的我，还是从人性上面考虑，通过行为推断今后的可能性，所以还是搬了进去。</p>
<p>优点是依然走路上班，晚上还可以去黄浦江边跑步，生活算是提高了吧。但是房间小的很，只有一个床的位置，之前的人体工学椅就卖掉了。由于在一楼的原因，总是能听到外面的声音，闻到外面的味道，无法随心所欲的开窗户。</p>
<p>虽然房子距离公司很近，但是因为没有通勤时间，消耗在通勤时间该看的书是一点也没看。这时候决定强化一下技能，辞职去表哥家待了有半年。</p>
<h2 id="第四个房子">第四个房子</h2>
<blockquote>
<p>免费的房子</p>
</blockquote>
<p>之前住在第二个房子的时候，大学室友来上海找工作，在我的房间住过一段时间。这次回到上海没有直接找房子，而是在他那住了三个多月。
他和大学其他寝室的同学租的两室一厅，还养了一只猫，后来还多了给我。很快找到了工作，但是不是特别理想，所以骑驴找马1个月后找到了我工作时间最久的工作。
回想起这个经历真是唏嘘。当时工作很容易找到，gap了半年加上工作一个月就换工作，这种情况依然可以很快的找到想要的工作。</p>
<p>不想再给同学添麻烦，搬出来了这个三人一猫的小窝</p>
<h2 id="第五个房子">第五个房子</h2>
<blockquote>
<p>近到可以中午回家睡觉</p>
</blockquote>
<p>这个房子比陆家嘴的房间要大一些，有了床也有了桌子。生活质量进一步提高，当年戴森推出v6型号的吸尘器，比我的房租还贵，我用它来打扫这个房子。
这个房子给我带来很多便利，室友是高中老师，有时候会带学生回家来补课。看着门外或站着或坐着的上海本地人对我礼貌的问好。
我遇到的上海人和别人打招呼都用上海话的，发现听不懂才切换为普通话。他们有着自己自豪的东西，借了室友的光，我也见到了</p>
<h2 id="第六个房子">第六个房子</h2>
<blockquote>
<p>剧组到小区取景</p>
</blockquote>
<h2 id="第七个房子">第七个房子</h2>
<blockquote>
<p>攒钱买房</p>
</blockquote>
<h2 id="第八个房子">第八个房子</h2>
<blockquote>
<p>黄浦江边溜达</p>
</blockquote>
<h2 id="第九个房子">第九个房子</h2>`,l={title:"我居住过的房子",publishDate:"8 Mar 2024",description:"在上海生活的十年，我住过很多的房子，房子有大有小，也住过租金是第一份工作四倍的房子，他们都是在对应时期做的最佳选择，现在回想一一列出还挺有意思",tags:["生活"],draft:!0,minutesRead:"8 min read"},r="/home/runner/work/blog/blog/src/content/post/the-houses-i-have-lived-in.md",s=void 0;function g(){return`
不知不觉已经来上海10年了。突然有天脑子一热想起我在上海还住过这么多的房子，给来上海打拼的人分享一下这段经历。

## 第一个房子

> 公司租在附近的公寓，像大学宿舍一样。

来到上海的第一个房子是公司帮忙给租的并且支付了半年的租金，因为是校招直接过来，也算是让我们初来乍到的异乡的人有一个平滑的过渡。
这个房子是在公司附近的一个公寓，离公司很近，走路10分钟就到了，但是距离商业区远，出去玩还要公交转地铁。电费是商业的资费，一个房间能住2-3个人，有桌子有床和大学宿舍一样。
离公司近，公司食堂有三餐，所以这个时候的生活还是很简单的，每天上班下班，周末出去玩。

类群居的生活有点像大学宿舍，时不时就可以来个串门，出于隐私的考虑，我也不是很喜欢突如其来的造访。出于这个考虑，一年后和同事合租搬出去了。

## 第二个房子

> 中介极力劝说房东退押金给我，但是我放弃了

这个房子在热闹一点的地方，回归了民用水电，楼下小吃丰富，出门就是地铁，走几步就是商业街，比之前方便了不少。在这个时候我还买了一个人体工学椅，算是追求生活质量的第一个投入。
室友住了半年搬走了，我在两个月后也换工作搬走了。合同写的有变化提前一个月沟通可以退回押金，但是房东不同意，加上我的下一个房子可能有地方要咨询她，即便中介在和房东沟通，我还是和房东达成一致，押金就半推半就象征性的退了一点点。
实际今后的合同都是违约方承当损失，我的这个行为在今后的合同上都是无法拿到押金的。这算是商业社会的一个小插曲吧。

小区排水不好，下大雨的时候水可以漫过鞋面，房子里面有北方人没见过的超大蟑螂，我怕它们胜过它们怕我。其实失去了室友这个成本也有点高，所以我也是很快就搬走了。

## 第三个房子

> 没有签订租房合同。我提前搬走还要回了押金。

这次搬到了陆家嘴的城中村，一楼(这个阶段有了楼层的意识)。我的室友二房东他和房东第一次租房合同到期后就没再签合同，但是继续保持了租房关系，所以我自然也看不到租房合同，同时我也不是通过中介联系到的，我们也就没有一份正式的合同。
在上一个房子搬出来的时候，和房东咨询的就是这件事，她是一个律师，说这样我的权益得不到保障。但这个经历的我，还是从人性上面考虑，通过行为推断今后的可能性，所以还是搬了进去。

优点是依然走路上班，晚上还可以去黄浦江边跑步，生活算是提高了吧。但是房间小的很，只有一个床的位置，之前的人体工学椅就卖掉了。由于在一楼的原因，总是能听到外面的声音，闻到外面的味道，无法随心所欲的开窗户。

虽然房子距离公司很近，但是因为没有通勤时间，消耗在通勤时间该看的书是一点也没看。这时候决定强化一下技能，辞职去表哥家待了有半年。

## 第四个房子

> 免费的房子

之前住在第二个房子的时候，大学室友来上海找工作，在我的房间住过一段时间。这次回到上海没有直接找房子，而是在他那住了三个多月。
他和大学其他寝室的同学租的两室一厅，还养了一只猫，后来还多了给我。很快找到了工作，但是不是特别理想，所以骑驴找马1个月后找到了我工作时间最久的工作。
回想起这个经历真是唏嘘。当时工作很容易找到，gap了半年加上工作一个月就换工作，这种情况依然可以很快的找到想要的工作。

不想再给同学添麻烦，搬出来了这个三人一猫的小窝

## 第五个房子

> 近到可以中午回家睡觉

这个房子比陆家嘴的房间要大一些，有了床也有了桌子。生活质量进一步提高，当年戴森推出v6型号的吸尘器，比我的房租还贵，我用它来打扫这个房子。
这个房子给我带来很多便利，室友是高中老师，有时候会带学生回家来补课。看着门外或站着或坐着的上海本地人对我礼貌的问好。
我遇到的上海人和别人打招呼都用上海话的，发现听不懂才切换为普通话。他们有着自己自豪的东西，借了室友的光，我也见到了

## 第六个房子

> 剧组到小区取景

## 第七个房子

> 攒钱买房

## 第八个房子

> 黄浦江边溜达

## 第九个房子`}function m(){return t}function q(){return[{depth:2,slug:"第一个房子",text:"第一个房子"},{depth:2,slug:"第二个房子",text:"第二个房子"},{depth:2,slug:"第三个房子",text:"第三个房子"},{depth:2,slug:"第四个房子",text:"第四个房子"},{depth:2,slug:"第五个房子",text:"第五个房子"},{depth:2,slug:"第六个房子",text:"第六个房子"},{depth:2,slug:"第七个房子",text:"第七个房子"},{depth:2,slug:"第八个房子",text:"第八个房子"},{depth:2,slug:"第九个房子",text:"第九个房子"}]}const f=e((c,h,d)=>{const{layout:i,...n}=l;return n.file=r,n.url=s,o`${p()}${u(t)}`});export{f as Content,m as compiledContent,f as default,r as file,l as frontmatter,q as getHeadings,g as rawContent,s as url};
